{
    "version": "https://jsonfeed.org/version/1",
    "title": "Pragya Reads!!",
    "description": "",
    "home_page_url": "https://pragya42.github.io",
    "feed_url": "https://pragya42.github.io/feed.json",
    "user_comment": "",
    "icon": "https://pragya42.github.io/media/website/v1logo2.png",
    "author": {
        "name": "Pragya Jatav"
    },
    "items": [
        {
            "id": "https://pragya42.github.io/wuthering-heights-by-emily-bronte/",
            "url": "https://pragya42.github.io/wuthering-heights-by-emily-bronte/",
            "title": "Wuthering Heights by Emily Bronte",
            "summary": "I won't really call this a review, because I am more confused&hellip;",
            "content_html": "<p>I won't really call this a review, because I am more confused about it than I was the last time I read the book. This book will leave you (or it left me) utterly devastated, lonely and hateful. Not to mention confused. It is a beautifully written book though.  It shines while depicting complicated emotions. And the dialogue! Even though I don't care for a single character in this story, I listen when they talk. Also, the setting  Wuthering heights and Thushcross Grange and the moor is so great. I have way too many tinfoily theories about that place. The only character I have strong feelings about is Nelly and I hate her. There is a huge conversation about her being the unreliable narrator too. And I really liked where Catherine ended up. Not the state but the place. Trying really hard to be spoiler-free. I think I need more time and re-reads to make conversation about the themes of trauma and love etc. in this book. To be honest, I don't know what I read, but it did make me feel extremely agitated, so I guess it's truly good literature. As a good piece of literature is supposed to make you feel heightened emotions. That's not me! Plato said it. Also, I don't think he meant it in a positive way. All I can say for sure is that it's a classic and everyone should experience it at least once. </p>",
            "image": "https://pragya42.github.io/media/posts/1/test-1.jpg",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
                   "Classic Lit"
            ],
            "date_published": "2021-09-18T00:04:32+05:30",
            "date_modified": "2021-09-18T00:04:32+05:30"
        },
        {
            "id": "https://pragya42.github.io/tbr/",
            "url": "https://pragya42.github.io/tbr/",
            "title": "TBR",
            "summary": " I love deadlines, I love the whooshing sound they make as&hellip;",
            "content_html": "<blockquote>\n<p>I love deadlines, I love the whooshing sound they make as they pass by - Douglas Adams</p>\n</blockquote>\n<p>Here's my to read list for september. It'll be nice to se how I'll read, when I know what I have to read.</p>\n<ul>\n<li><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\"><em>The fifth elephant by Terry Pratchett:</em> It's the fifth book in the discworld series, I've been reading the discworld universe for the past year. As far as I know, Captian Vimes has to be a diplomat in this one. I already know this is going to be great! </span></li>\n<li><em>The Night Watch by Terry Pratchett: </em>It's the next book after fifth elephant in the Discworld : Ankh - Morpok city watch series. And it has a bit of time travel elememt to it. So I'm pretty sure we'll see the librarian as well. </li>\n<li><em>The book of Margery Kempe:</em> In the middle ages travelogues were quite a thing, but most of the travels were pilgrimages. This book isn't just a travelogue, but some people regard it as the first autobiography in English. It was dictated actually. I'm not sure what to expect from this book, but I'm pretty sure it'll be quite intersting. Also she was a mystic.</li>\n<li><em>The dragonbone chair: St</em>arting an epic fantasy series is difficult. This is the first book in Memory, Sorrow and Thorn series. I had actually started it in august. I hope I finish it. So far we're just following one character, and he's also not very interesting. But I got to know it gets really good later.</li>\n<li><em>Ancient Indian History by R. S. Sharma: </em>I think this a school level book for ancient Indian history. But I get really confused while reading books about ancient India so I guess basics would be nice. </li>\n<li><em>The eye of the world by Robert Jordan :</em> It's been so long since I read the wheel of time. This time I'm reading it with a lot of people, so that I am able to finish it till November.</li>\n</ul>",
            "image": "https://pragya42.github.io/media/posts/3/poem1.jpg",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
                   "Fantasy",
                   "Classic Lit"
            ],
            "date_published": "2021-09-02T01:20:00+05:30",
            "date_modified": "2021-09-18T14:55:39+05:30"
        }
    ]
}
