{
    "version": "https://jsonfeed.org/version/1",
    "title": "Pragya Reads!!",
    "description": "",
    "home_page_url": "https://pragya42.github.io",
    "feed_url": "https://pragya42.github.io/feed.json",
    "user_comment": "",
    "icon": "https://pragya42.github.io/media/website/v1logo2.png",
    "author": {
        "name": "Pragya Jatav"
    },
    "items": [
        {
            "id": "https://pragya42.github.io/december20-wrap-up/",
            "url": "https://pragya42.github.io/december20-wrap-up/",
            "title": "December&#x27;21 Wrap up!!",
            "summary": " The Master and Margarita by Mikhail Bulgakov: I haven't finished this&hellip;",
            "content_html": "<ol>\n<li>\n<p id=\"bookTitle\" class=\"gr-h1 gr-h1--serif\"><a href=\"https://www.goodreads.com/book/show/117833.The_Master_and_Margarita\" target=\"_blank\" rel=\"noopener noreferrer\">The Master and Margarita by Mikhail Bulgakov:</a> I haven't finished this yet, but it's already one of my favorite books of all time! It's perfect. The Russian names get a bit confusing, especially because you have to know their first names, last names, and possibly another name, it gets more difficult when you're listening to it. All the absurd, unthinkable things happen so naturally, that one would think it was totally normal. The Pontius Pilate storyline is my favorite yet. I'll finish it in 2022.</p>\n</li>\n<li><a href=\"https://www.goodreads.com/book/show/44424290-magical-women\" target=\"_blank\" rel=\"noopener noreferrer\">Magical Women</a>: This book is doing wonders for my TBR, I've found so many great Indian authors because of it. Also, I don't know why I stopped reading short stories. Pairing them with epic fantasy series is so so great. It's given me so much more perspective on contemporary literature and folktales. About the book, it's a very strong anthology. There we one or two misses but except that almost every story was so wonderful. My favourite is <span style=\"color: #beb2de;\">The Carnival at the Edge of the World by Shveta Thakrar<span style=\"color: #000000;\"> it is a </span></span><span style=\"color: #000000;\">retelling of ‘Nala and Damayanti’.</span></li>\n<li><a href=\"https://www.goodreads.com/book/show/944073.The_Blade_Itself\" target=\"_blank\" rel=\"noopener noreferrer\">The blade itself by Joe Abercrombie :</a> Okay! It didn't rain like I thought it would, the weather was way too pleasant actually. But despite the sun, these morally gray characters are scary. Nothing is scarier than a perfectly written, well fleshed out terrible character, that could so possibly exist in the world. But it's not just the characters, the writing's beautiful, the pacing is awesome. It's so action-packed. Also, the prologue seems like a cold open for a very dark T.V. show, and I totally love it. I'm so going to binge this trilogy in 2022.</li>\n<li><a href=\"https://www.goodreads.com/book/photo/7811979-the-stone-of-farewell\" target=\"_blank\" rel=\"noopener noreferrer\">The Stone of Farewell by Tad Williams:</a> The dragonbone chair was so good, I don't know how is it possible to write a sequel that's a thousand times better, well maybe coz Simon is less whiny now. It's like I got everything I wished for and more!! Miramelle is one of the best female characters I've read. I got to know more about Binabik's story, and it was awesome. All the other characters are so so so good (even Cadrach)! Also, why are Maegwin and Eolair such a slow burn!!! The whole world-building is so cool, and I was so not ready for the twist! (if you know you know!). Truly I never saw it coming. There are so many reunions that you'll be crying for all through the book. Also, I can't stop thinking about the parallels between this and ASOIAF. I guess just like The Two towers and return of the King, I would always be confused about which one I like the most (Yes!!!!! I'm about to finish to Green Angel Tower!! Finally!!! Well actually about 200 pages are left but we'll get there). The end was great, I could see this parallel of someone pledging to protect someone and then not being able to protect them, and it scares me. I do have two criticisms. Firstly what is it with Joshua's love story, it has some good moments but it's just very iffy to me. And it also makes me like him less. Secondly Elias and Pyrartes (God! I hate him!) What are they doing? Why are they doing this, it just does not make much sense to me.</li>\n<li><a href=\"https://www.goodreads.com/book/show/28691.To_Green_Angel_Tower?from_search=true&amp;from_srp=true&amp;qid=VB0kkoPsA9&amp;rank=1\" target=\"_blank\" rel=\"noopener noreferrer\">To Green Angel Tower by Tad Williams:</a> I have started the second part of the second part, and it's awesome!!!</li>\n<li><a href=\"https://www.goodreads.com/series/41526-the-wheel-of-time\" target=\"_blank\" rel=\"noopener noreferrer\">The great hunt by Robert Jordan</a>: It's much better than the eye of the world, but I don't know what happens to the ending. All I'd say is it's not one of the best. And we don't even get much exposition :/ which is just bad. And I feel exhausted when the characters travel.</li>\n</ol>\n<p><a href=\"https://in.pinterest.com/pin/29977153759914826/\">(229) Pinterest</a> </p>\n<hr>\n<p> </p>",
            "image": "https://pragya42.github.io/media/posts/11/3025fd2cf912485e134e6309b8471fba.jpg",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
                   "Wrap-ups",
                   "Fantasy"
            ],
            "date_published": "2022-01-01T16:54:00+05:30",
            "date_modified": "2022-01-04T17:03:24+05:30"
        },
        {
            "id": "https://pragya42.github.io/december-tbr/",
            "url": "https://pragya42.github.io/december-tbr/",
            "title": "December TBR",
            "summary": "Woah! December is here. I do have some free time in December&hellip;",
            "content_html": "<p>Woah! December is here. I do have some free time in December since I am home and winter is here. Haven't seen the sun in two days. All I want to do right now is read. I hope I'll travel sometime during the month (more time to read!) So I have made a long list this time. </p>\n<ol>\n<li>\n<p id=\"bookTitle\" class=\"gr-h1 gr-h1--serif\"><a href=\"https://www.goodreads.com/book/show/117833.The_Master_and_Margarita\" target=\"_blank\" rel=\"noopener noreferrer\">The Master and Margarita by Mikhail Bulgakov:</a> I have been wanting to read more non european typical fantasy books. And this is based in Russia. From what I've heard it's absurdist, and is considered a very important part of modern Russian Literature. Very Excited!! I also found <a href=\"https://www.goodreads.com/review/show/391549176?book_show_action=false&amp;from_review_page=1\" target=\"_blank\" rel=\"noopener noreferrer\">this great review</a> by a friend which made me want to read it a lot. </p>\n</li>\n<li><a href=\"https://www.goodreads.com/book/show/44424290-magical-women\" target=\"_blank\" rel=\"noopener noreferrer\">Magical Women</a>: Fantasy check! Literature by women, check! short stories, check! Had to pick it up! Idk why I didn't till now!</li>\n<li><a href=\"https://www.goodreads.com/book/show/944073.The_Blade_Itself\" target=\"_blank\" rel=\"noopener noreferrer\">The blade itself by Joe Abercrombie : </a>This is the first book of The first Law Triology. It's winter, it'll probably rain on the weekend. And grim dark is perfect for such times. So yeah! My weekend is sorted! </li>\n<li><a href=\"https://www.goodreads.com/book/show/28691.To_Green_Angel_Tower?from_search=true&amp;from_srp=true&amp;qid=VB0kkoPsA9&amp;rank=1\" target=\"_blank\" rel=\"noopener noreferrer\">To Green Angel Tower by Tad Williams:</a> I know I won't be able to finish it. Well even it's divided into two parts. Also, if Memory, Sorrow and thorn are three swords then how do we have four different swords on the cover of the four books? I can find out, but maybe I'll just read.</li>\n<li>Books I'm about to finish:\n<ol>\n<li>The Stone of Farewell by Tad Williams ( Yes I know :( but only 10% is left so maybe)</li>\n<li>The great hunt by Robert Jordan: I'm not really in a rush to finish it. The show is mixing arcs from different books, and I was able to recognize most of the details.</li>\n</ol>\n</li>\n</ol>\n<p>Image credits : <a href=\"https://in.pinterest.com/pin/36028865759838467/\">(163) Pinterest</a></p>\n<hr>\n<p> </p>",
            "image": "https://pragya42.github.io/media/posts/8/e6402b8f50dc7c1a24b601a52deade5a.jpg",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
                   "TBRS"
            ],
            "date_published": "2021-12-02T15:34:03+05:30",
            "date_modified": "2021-12-02T15:54:18+05:30"
        },
        {
            "id": "https://pragya42.github.io/october-tbr/",
            "url": "https://pragya42.github.io/october-tbr/",
            "title": "October TBR",
            "summary": "Here's my TBR for the month of October. I'm still working on&hellip;",
            "content_html": "<p>Here's my TBR for the month of October. I'm still working on my september reviews (cying in the corner? check.</p>\n<ol>\n<li>The lord of the Rings: Found an amazing audio version on spotify. I am already on the second half of the two towers.</li>\n<li>Pride and Prejudice: Ahhh bless you spotify. They do have a lot of classics.</li>\n<li>The bell jar: Really want to read this on my new kindle</li>\n<li>The stone of farewell: Of course! Yes I dread the third book. But I hope I'll find an audiobook or something. I just want to know what happens next.</li>\n<li>The Night Watch: I think I started reading a bit. but then didn't. </li>\n</ol>\n<p>I'll try to pickup some non fiction too. But so far this is it!</p>",
            "image": "https://pragya42.github.io/media/posts/6/ba3ec809eb90570a9c576fb9dc9d5d60.jpg",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
                   "TBRS"
            ],
            "date_published": "2021-10-11T16:18:43+05:30",
            "date_modified": "2021-10-11T16:19:41+05:30"
        },
        {
            "id": "https://pragya42.github.io/about/",
            "url": "https://pragya42.github.io/about/",
            "title": "About! ",
            "summary": " Hi, I am Pragya Jatav, I love books and taking pictures&hellip;",
            "content_html": "<figure class=\"post__image post__image--left\"><img loading=\"lazy\"  src=\"https://pragya42.github.io/media/posts/2/3240c1979cf10daa7d16a6aa8d56e2fe.webp\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://pragya42.github.io/media/posts/2/responsive/3240c1979cf10daa7d16a6aa8d56e2fe-xs.webp 300w ,https://pragya42.github.io/media/posts/2/responsive/3240c1979cf10daa7d16a6aa8d56e2fe-sm.webp 480w ,https://pragya42.github.io/media/posts/2/responsive/3240c1979cf10daa7d16a6aa8d56e2fe-md.webp 768w ,https://pragya42.github.io/media/posts/2/responsive/3240c1979cf10daa7d16a6aa8d56e2fe-lg.webp 1024w\"  alt=\"\" width=\"337\" height=\"253\"></figure>\n<p>Hi, I am<span style=\"color: #beb2de;\"> Pragya Jatav, </span>I  love books and taking pictures of my books. </p>",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
            ],
            "date_published": "2021-09-18T01:16:34+05:30",
            "date_modified": "2021-11-23T16:12:40+05:30"
        },
        {
            "id": "https://pragya42.github.io/wuthering-heights-by-emily-bronte/",
            "url": "https://pragya42.github.io/wuthering-heights-by-emily-bronte/",
            "title": "Wuthering Heights by Emily Bronte",
            "summary": "I won't really call this a review, because I am more confused&hellip;",
            "content_html": "<p>I won't really call this a review, because I am more confused about it than I was the last time I read the book. This book will leave you (or it left me) utterly devastated, lonely and hateful. Not to mention confused. It is a beautifully written book though.  It shines while depicting complicated emotions. And the dialogue! Even though I don't care for a single character in this story, I listen when they talk. Also, the setting  Wuthering heights and Thushcross Grange and the moor is so great. I have way too many tinfoily theories about that place. The only character I have strong feelings about is Nelly and I hate her. There is a huge conversation about her being the unreliable narrator too. And I really liked where Catherine ended up. Not the state but the place. Trying really hard to be spoiler-free. I think I need more time and re-reads to make conversation about the themes of trauma and love etc. in this book. To be honest, I don't know what I read, but it did make me feel extremely agitated, so I guess it's truly good literature. As a good piece of literature is supposed to make you feel heightened emotions. That's not me! Plato said it. Also, I don't think he meant it in a positive way. All I can say for sure is that it's a classic and everyone should experience it at least once. </p>",
            "image": "https://pragya42.github.io/media/posts/1/test-1.jpg",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
                   "Classic Lit"
            ],
            "date_published": "2021-09-18T00:04:32+05:30",
            "date_modified": "2021-09-18T00:04:32+05:30"
        },
        {
            "id": "https://pragya42.github.io/tbr/",
            "url": "https://pragya42.github.io/tbr/",
            "title": "TBR",
            "summary": " I love deadlines, I love the whooshing sound they make as&hellip;",
            "content_html": "<blockquote>\n<p>I love deadlines, I love the whooshing sound they make as they pass by - Douglas Adams</p>\n</blockquote>\n<p>Here's my to read list for september. It'll be nice to se how I'll read, when I know what I have to read.</p>\n<ul>\n<li><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\"><em>The fifth elephant by Terry Pratchett:</em> It's the fifth book in the discworld series, I've been reading the discworld universe for the past year. As far as I know, Captian Vimes has to be a diplomat in this one. I already know this is going to be great! </span></li>\n<li><em>The Night Watch by Terry Pratchett: </em>It's the next book after fifth elephant in the Discworld : Ankh - Morpok city watch series. And it has a bit of time travel elememt to it. So I'm pretty sure we'll see the librarian as well. </li>\n<li><em>The book of Margery Kempe:</em> In the middle ages travelogues were quite a thing, but most of the travels were pilgrimages. This book isn't just a travelogue, but some people regard it as the first autobiography in English. It was dictated actually. I'm not sure what to expect from this book, but I'm pretty sure it'll be quite intersting. Also she was a mystic.</li>\n<li><em>The dragonbone chair: St</em>arting an epic fantasy series is difficult. This is the first book in Memory, Sorrow and Thorn series. I had actually started it in august. I hope I finish it. So far we're just following one character, and he's also not very interesting. But I got to know it gets really good later.</li>\n<li><em>Ancient Indian History by R. S. Sharma: </em>I think this a school level book for ancient Indian history. But I get really confused while reading books about ancient India so I guess basics would be nice. </li>\n<li><em>The eye of the world by Robert Jordan :</em> It's been so long since I read the wheel of time. This time I'm reading it with a lot of people, so that I am able to finish it till November.</li>\n</ul>",
            "image": "https://pragya42.github.io/media/posts/3/poem1.jpg",
            "author": {
                "name": "Pragya Jatav"
            },
            "tags": [
                   "TBRS",
                   "Fantasy",
                   "Classic Lit"
            ],
            "date_published": "2021-09-02T01:20:00+05:30",
            "date_modified": "2021-10-11T16:19:55+05:30"
        }
    ]
}
